{
  "backend/main.mo": "Main canister logic defining products, orders, inquiries, user profiles, and access-controlled admin/user operations.",
  "backend/migration.mo": "Migration module that maps old actor state to the new actor format while dropping deprecated admin fields.",
  "feature_evidence.json": "Feature evidence report describing a specific admin access-denied copy update and the files affected.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files for reference or documentation.",
  "frontend/index.css": "Global Tailwind-based CSS defining OKLCH theme variables and light/dark mode styles.",
  "frontend/index.html": "Base HTML entry point mounting the React application with the site title.",
  "frontend/src/App.tsx": "Root React setup configuring routes, providers, and global layout for the application.",
  "frontend/src/cart/CartContext.tsx": "React context managing cart state with localStorage persistence and item operations.",
  "frontend/src/cart/cartTypes.ts": "Type definitions and utility functions for cart items, totals, and conversion to backend order items.",
  "frontend/src/components/admin/AdminGuard.tsx": "Protects admin routes by checking authentication and admin status, showing loading, login, error, or authorized content states.",
  "frontend/src/components/admin/AdminOrderDetailsDialog.tsx": "Displays a dialog showing detailed order information including customer data, items, totals, and timestamps.",
  "frontend/src/components/admin/AdminOrdersTable.tsx": "Fetches and displays all orders in a table with loading, error, unauthorized, and empty states plus a details dialog.",
  "frontend/src/components/admin/ProductImportPanel.tsx": "UI for uploading and parsing product import files, displaying parse errors, and sending valid products to the backend.",
  "frontend/src/components/app/AppInquiryPanel.tsx": "Inquiry form that submits user messages and shows success or error status.",
  "frontend/src/components/app/AppProductList.tsx": "Displays products from backend or sample data, handles loading and errors, and allows adding items to the cart.",
  "frontend/src/components/app/AppShell.tsx": "Mobile app shell with top bar, bottom navigation, and section switching.",
  "frontend/src/components/auth/AuthControl.tsx": "Authentication control handling Internet Identity login/logout and principal copying.",
  "frontend/src/components/catalog/SampleCatalogNotice.tsx": "Alert banner indicating sample products are shown and linking to admin import page.",
  "frontend/src/components/SiteFooter.tsx": "Renders a multi-column site footer with branding, navigation links, services, contact details, and a dynamic year and referral link.",
  "frontend/src/components/SiteHeader.tsx": "Implements a responsive header with logo, navigation, cart indicator, admin link, auth controls, and a mobile menu.",
  "frontend/src/content/sampleContent.ts": "Provides sample store info, sample products, and sample services used as fallback content.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, invalidating related queries when the actor updates.",
  "frontend/src/hooks/useDocumentTitle.ts": "Updates the document title on mount and restores the previous title on unmount.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, including login, logout, identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching products, orders, admin status, and performing mutations using the actor.",
  "frontend/src/index.css": "Global Tailwind CSS setup with themes, utilities, and custom styles for components and admin UI.",
  "frontend/src/main.tsx": "Initializes the React app with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with company story, values, and branding, setting the page title.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard with tabs for managing orders and importing products, protected by an admin guard.",
  "frontend/src/pages/AppPage.tsx": "Main app page managing catalog and inquiry sections within the AppShell layout.",
  "frontend/src/pages/CartPage.tsx": "Displays cart items, allows quantity updates and item removal, shows totals, and handles navigation to checkout or products.",
  "frontend/src/pages/CheckoutPage.tsx": "Validates customer info, places orders using cart data, redirects on empty cart, and clears cart after successful submission.",
  "frontend/src/pages/ContactPage.tsx": "Shows store contact info and a form that submits customer inquiries and displays a temporary success message.",
  "frontend/src/pages/HomePage.tsx": "Renders homepage hero, features, and product previews using backend or sample data.",
  "frontend/src/pages/OrderPlacedPage.tsx": "Shows order confirmation with order ID and navigation options after successful checkout.",
  "frontend/src/pages/ProductQuantityPage.tsx": "Loads a product, lets users select quantity, add to cart or buy now, and handles loading and error states.",
  "frontend/src/pages/ProductsPage.tsx": "Product listing page with search, category/brand filters, backend-or-sample data fallback, and quick add-to-cart handling.",
  "frontend/src/pages/ServicesPage.tsx": "Displays a grid of predefined service offerings with icons and a section explaining service benefits.",
  "frontend/src/utils/formatCurrency.ts": "Formats bigint prices into INR currency strings using en-IN locale.",
  "frontend/src/utils/parseProductImportFile.ts": "Parses CSV/XLSX product import files, mapping columns, extracting rows, and collecting validation errors.",
  "frontend/src/utils/principalFormat.ts": "Safely extracts principal IDs and provides truncation for display.",
  "frontend/src/utils/safeParse.ts": "Provides safe parsing helpers for BigInt, positive integers, and quantity validation.",
  "frontend/src/utils/urlParams.ts": "Utility for reading, persisting, and clearing URL/session parameters, supporting hash-based routing.",
  "frontend/tailwind.config.js": "TailwindCSS configuration with custom colors, fonts, animations, and plugin setup.",
  "project_state.json": "Project state metadata describing admin-access issues, existing features, and pending requirements."
}