{
  "backend/main.mo": "Motoko actor implementing product catalog, orders, inquiries, and user profiles with admin‑restricted modifications and access‑controlled queries.",
  "feature_evidence.json": "Empty feature evidence report scaffold.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files for reference or tooling.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH theme variables for light/dark mode and applying global background/text styles.",
  "frontend/index.html": "Base HTML entry point mounting the React app and setting the site title.",
  "frontend/src/App.tsx": "Main routing setup using TanStack Router with layout and routes for products, checkout, admin, and app views.",
  "frontend/src/components/admin/AdminGuard.tsx": "Protects admin routes by checking authentication and admin status, showing login, loading, or access-denied states as needed.",
  "frontend/src/components/admin/AdminOrdersTable.tsx": "Fetches and displays all customer orders in a sortable table with loading, error, and empty states.",
  "frontend/src/components/admin/ProductImportPanel.tsx": "Handles uploading, parsing, validating, and importing product spreadsheets with success and error feedback.",
  "frontend/src/components/app/AppInquiryPanel.tsx": "Provides a customer inquiry form that submits data to the backend and shows success or error messages.",
  "frontend/src/components/app/AppProductList.tsx": "Displays a product catalog using backend data or sample data with full loading, error, and empty states.",
  "frontend/src/components/app/AppShell.tsx": "Layout wrapper providing header, content area, and bottom navigation for catalog and inquiry sections.",
  "frontend/src/components/auth/AuthControl.tsx": "UI component handling login/logout with Internet Identity and principal copying.",
  "frontend/src/components/catalog/SampleCatalogNotice.tsx": "Alert banner notifying users that sample products are displayed and linking to admin.",
  "frontend/src/components/SiteFooter.tsx": "Footer showing brand info, navigation links, services list, and updated contact details.",
  "frontend/src/components/SiteHeader.tsx": "Responsive header with logo, navigation (including Admin/App), mobile menu, and AuthControl integration.",
  "frontend/src/content/sampleContent.ts": "Provides static sample store info, products, and service listings for demo content.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor tied to the user's identity and invalidates queries on changes.",
  "frontend/src/hooks/useDocumentTitle.ts": "Hook that updates the document title and restores the previous one on unmount.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider managing Internet Identity authentication, identities, and login state.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks wrapping backend calls for products, orders, inquiries, profiles, and admin checks.",
  "frontend/src/index.css": "Tailwind CSS setup defining color themes, layout utilities, and custom component styles.",
  "frontend/src/main.tsx": "Application entry point setting up React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/AboutPage.tsx": "Renders an About page with company story, values, and a logo using cards and icons.",
  "frontend/src/pages/AdminPage.tsx": "Provides an admin dashboard with tabs for viewing orders and importing products, protected by an admin guard.",
  "frontend/src/pages/AppPage.tsx": "Shows a mobile app-like shell that switches between a product catalog and an inquiry panel.",
  "frontend/src/pages/CheckoutPage.tsx": "Handles checkout flow including form validation, product lookup, and order submission.",
  "frontend/src/pages/ContactPage.tsx": "Displays contact information and a form for submitting inquiries with success feedback.",
  "frontend/src/pages/HomePage.tsx": "Home page featuring store hero content, features, and a small product showcase using backend or sample data.",
  "frontend/src/pages/OrderPlacedPage.tsx": "Shows order confirmation details and navigation options after a successful order.",
  "frontend/src/pages/ProductQuantityPage.tsx": "Product detail page allowing quantity selection, price calculation, and navigation to checkout with validation and loading/error states.",
  "frontend/src/pages/ProductsPage.tsx": "Product catalog with search, filters, sample data fallback, and navigation to individual product pages.",
  "frontend/src/pages/ServicesPage.tsx": "Displays a grid of predefined services with icons and a section explaining service benefits.",
  "frontend/src/utils/formatCurrency.ts": "Formats bigint prices into INR currency strings using en-IN locale.",
  "frontend/src/utils/parseProductImportFile.ts": "Parses CSV/XLSX files into product objects, validates required fields, and collects row-level errors.",
  "frontend/src/utils/principalFormat.ts": "Safely extracts and truncates Internet Identity principal strings for display.",
  "frontend/src/utils/safeParse.ts": "Provides safe parsing utilities for BigInt and positive integers plus a quantity validator.",
  "frontend/src/utils/urlParams.ts": "Utility for reading, persisting, and clearing URL parameters with session storage support.",
  "frontend/tailwind.config.js": "Tailwind CSS config defining dark mode, content paths, extended theme options, custom colors, animations, and plugins.",
  "project_state.json": "Project state describing admin-access issues, required admin seeding, and pending feature requests to register and persist a specific admin Principal."
}