{
  "backend/main.mo": "Motoko canister managing products and inquiries with CRUD-style functions, auto-incrementing product IDs, and query endpoints for retrieval.",
  "feature_evidence.json": "Feature evidence report listing implemented feature IDs, affected files, components, and test references for contact updates and watermark feature.",
  "frontend-file-summaries.txt": "Pre-generated summaries describing the purpose of various frontend files including styling, routing, pages, and utilities.",
  "frontend/index.css": "Tailwind base and theme variable definitions for light/dark modes, including color tokens and global background/foreground settings.",
  "frontend/index.html": "Base HTML document defining the root mount point and setting the site title for SISTER TELESYSTEM.",
  "frontend/src/App.tsx": "Main React app configuring TanStack Router and applying a root layout with a site-wide watermark, header, and footer.",
  "frontend/src/components/SiteFooter.tsx": "Footer component showing brand info, navigation links, services list, and updated contact details with address, phone, and email.",
  "frontend/src/components/SiteHeader.tsx": "Responsive header with logo, desktop and mobile navigation, and active-route highlighting using TanStack Router state.",
  "frontend/src/content/sampleContent.ts": "Provides sample store info, product listings with BigInt IDs, and service descriptions for display.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useDocumentTitle.ts": "Updates the browser tab title and restores the previous title on unmount.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context provider handling auth client creation, identity loading, login, and logout.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching all products and submitting inquiries via the backend actor.",
  "frontend/src/index.css": "Defines Tailwind base styles, color variables, dark mode settings, utilities, and custom components like product grids and watermarks.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider and renders the root component.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with story content, values, branding, and sets the document title.",
  "frontend/src/pages/ContactPage.tsx": "Renders the contact page with store info, an inquiry form using mutation, and success handling.",
  "frontend/src/pages/HomePage.tsx": "Home page component showing hero section, featured products, and feature cards using backend or sample product data.",
  "frontend/src/pages/ProductsPage.tsx": "Products listing page with search, category and brand filters, using backend or sample products.",
  "frontend/src/pages/ServicesPage.tsx": "Services page displaying a grid of sample services with mapped icons and a section explaining service benefits.",
  "frontend/src/utils/formatCurrency.ts": "Utility function formatting bigint prices as INR currency using en-IN locale.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme colors, fonts, animations, and plugin setup for typography, container queries, and animations.",
  "project_state.json": "Project state metadata describing features, requirements, notes, and current build context for the mobile store website."
}