{
  "backend/main.mo": "Motoko backend actor managing products, orders, inquiries, and user profiles with admin/user authorization and CRUD-style product queries.",
  "feature_evidence.json": "JSON report listing feature requirements, associated frontend files, components, and test IDs for admin and theming features.",
  "frontend-file-summaries.txt": "Reference file containing prewritten summaries for numerous frontend components, pages, hooks, and utilities.",
  "frontend/index.css": "Tailwind base styles defining a full OKLCH variable color system for light/dark themes and applying global background/foreground defaults.",
  "frontend/index.html": "Static HTML shell setting the site title and mounting the root React application.",
  "frontend/src/App.tsx": "Main React entry wiring TanStack Router, React Query, Internet Identity, and CartProvider with all application routes.",
  "frontend/src/cart/CartContext.tsx": "React context managing cart state with localStorage persistence, item CRUD operations, and computed item counts.",
  "frontend/src/cart/cartTypes.ts": "Type definitions for cart items plus helpers for converting to backend order items and computing totals/counts.",
  "frontend/src/components/admin/AdminGuard.tsx": "Protects admin routes by checking authentication and admin status, showing loading, login prompts, or errors as needed.",
  "frontend/src/components/admin/AdminOrderDetailsDialog.tsx": "Displays a dialog with full order details including customer info, items, and formatted dates/prices.",
  "frontend/src/components/admin/AdminOrdersTable.tsx": "Fetches and displays all orders in a table with loading, error, unauthorized states, and a details dialog per order.",
  "frontend/src/components/admin/ProductImportPanel.tsx": "UI panel for uploading a product file, parsing it, showing errors, and importing valid products via mutation.",
  "frontend/src/components/app/AppInquiryPanel.tsx": "Inquiry form that submits user messages to the backend and shows success or error feedback.",
  "frontend/src/components/app/AppProductList.tsx": "Displays product catalog using backend data or sample data with loading, error, and add‑to‑cart handling.",
  "frontend/src/components/app/AppShell.tsx": "App layout with top bar, content area, and bottom navigation controlling catalog, cart, and inquiry sections.",
  "frontend/src/components/auth/AuthControl.tsx": "Handles login/logout with Internet Identity, shows principal info, and allows copying the principal.",
  "frontend/src/components/catalog/SampleCatalogNotice.tsx": "Alert banner informing users they are viewing sample products and linking to the admin page.",
  "frontend/src/components/SiteFooter.tsx": "Renders the site footer with branding, navigation links, services list, contact info, and dynamic year/app identifier.",
  "frontend/src/components/SiteHeader.tsx": "Implements the site header with logo, navigation, cart badge, admin button, auth control, and responsive mobile menu.",
  "frontend/src/content/sampleContent.ts": "Exports store info plus sample products and services used as fallback content.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on the current identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useDocumentTitle.ts": "Sets the document title on mount and restores the previous title on unmount.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, stored identities, and client setup.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for products, orders, inquiries, admin checks, and admin claiming using the actor API.",
  "frontend/src/index.css": "Tailwind-based global styling with custom color variables, utilities, and admin UI styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/pages/AboutPage.tsx": "Renders an About page with company story, values, and branding.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard with tabbed views for orders and product import, protected by AdminGuard.",
  "frontend/src/pages/AppPage.tsx": "Main app page managing catalog and inquiry sections within the app shell.",
  "frontend/src/pages/CartPage.tsx": "Renders the shopping cart with item management, quantity updates, totals, and navigation to checkout or products.",
  "frontend/src/pages/CheckoutPage.tsx": "Handles checkout form validation, order submission, cart clearing, and redirects when the cart is empty.",
  "frontend/src/pages/ContactPage.tsx": "Displays contact information and a form to submit inquiries, including success handling and validation.",
  "frontend/src/pages/HomePage.tsx": "Shows the homepage with hero content, feature highlights, and featured products sourced from backend or sample data.",
  "frontend/src/pages/OrderPlacedPage.tsx": "Displays order confirmation details and provides navigation to continue shopping or return home.",
  "frontend/src/pages/ProductQuantityPage.tsx": "Loads a product, allows selecting quantity, and supports adding to cart or buying immediately with error handling.",
  "frontend/src/pages/ProductsPage.tsx": "React products listing page with search, filters, backend fallback to sample data, and cart integration.",
  "frontend/src/pages/ServicesPage.tsx": "Displays a grid of sample service offerings with icons and a section explaining service benefits.",
  "frontend/src/utils/formatCurrency.ts": "Formats bigint prices into INR currency using en-IN locale.",
  "frontend/src/utils/parseProductImportFile.ts": "Parses CSV/XLSX product import files, mapping columns and validating rows into structured products and errors.",
  "frontend/src/utils/principalFormat.ts": "Extracts principal strings from identities and provides a safe truncation helper for display.",
  "frontend/src/utils/safeParse.ts": "Provides safe parsing utilities for BigInt and positive integers plus quantity validation.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters with sessionStorage support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme colors, fonts, radii, shadows, animations, and content paths.",
  "project_state.json": "Describes the website project's state, including admin-access requirements, known issues, existing features, and new feature requests focused on fixing Live admin authorization. It outlines a single-admin model, backend admin APIs, and deployment stability needs."
}