{
  "kind": "build_request",
  "title": "Fix draft vs live admin access mismatch (grant production admin to specified principal)",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Ensure the production (Live) backend always recognizes the following principal as an admin: yrzqp-j2xon-ju7hr-g5ger-pe7by-pn666-ywayt-ii77y-rq7wz-xelxd-bae, while keeping the existing hardcoded admin principal ksdex-jr3fp-ll2uw-hoqgv-wlwa7-erlfc-juio3-m33lu-7dqc7-hzatt-uqe as an admin.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages-user-1"
        ],
        "quotes": [
          "WORKING IN DRAFT NOT BUT SHOWING THIS IN THE LIVE  PLEASE TELL ME THE PROBLM AND SOLVE IT"
        ]
      },
      "acceptanceCriteria": [
        "When logged in with principal yrzqp-j2xon-ju7hr-g5ger-pe7by-pn666-ywayt-ii77y-rq7wz-xelxd-bae in the Live deployment, admin checks return true and /admin renders the dashboard (Orders + Import Products) instead of Access Denied.",
        "Principal ksdex-jr3fp-ll2uw-hoqgv-wlwa7-erlfc-juio3-m33lu-7dqc7-hzatt-uqe remains an admin in both Draft and Live.",
        "Admin recognition does not depend on any URL token being present (e.g., caffeineAdminToken)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Fix upgrade/republish behavior so that publishing Live does not lose admin access (admin list/authorization state must not be reset to empty during migrations/upgrades).",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages-user-1"
        ],
        "quotes": [
          "WORKING IN DRAFT NOT BUT SHOWING THIS IN THE LIVE  PLEASE TELL ME THE PROBLM AND SOLVE IT"
        ]
      },
      "acceptanceCriteria": [
        "After an upgrade/redeploy, previously configured admin access continues to work in Live without requiring re-claiming admin or manual intervention.",
        "Migration logic (if used) preserves or re-establishes the admin principals so that Live does not regress to Access Denied for known admins."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update the Admin access denied screen copy to clearly explain that Draft and Live can run on different backend canisters with different stored admin state, and instruct the user to verify they are on the intended environment when reporting access issues.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-user-1"
        ],
        "quotes": [
          "WORKING IN DRAFT NOT BUT SHOWING THIS IN THE LIVE  PLEASE TELL ME THE PROBLM AND SOLVE IT"
        ]
      },
      "acceptanceCriteria": [
        "When a user is authenticated but not an admin, the Access Denied UI includes a short explanation that Draft vs Live deployments can have different admin configuration/state, using English user-facing text.",
        "Existing principal display and copy-to-clipboard functionality remains intact."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; only add/adjust migration.mo if required to preserve existing state across upgrades.",
    "Do not edit files under frontend/src/components/ui (read-only).",
    "Do not modify immutable paths listed in SYSTEM_CONTEXT (compose around them instead)."
  ],
  "nonGoals": [
    "Adding third-party authentication providers (only Internet Identity).",
    "Adding new admin UI features beyond clarifying the error message and restoring correct admin access.",
    "Introducing external databases or off-canister storage."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}